
## Plan Result (aat)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 5 to add, 10 to change, 47 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.flexible_secret_standard_format[&#34;DATABASE&#34;]
  * azurerm_key_vault_secret.flexible_secret_standard_format[&#34;HOST&#34;]
  * azurerm_key_vault_secret.flexible_secret_standard_format[&#34;PASS&#34;]
  * azurerm_key_vault_secret.flexible_secret_standard_format[&#34;PORT&#34;]
  * azurerm_key_vault_secret.flexible_secret_standard_format[&#34;USER&#34;]
* Update
  * azurerm_key_vault_secret.flexible_secret[&#34;DATABASE&#34;]
  * azurerm_key_vault_secret.flexible_secret[&#34;HOST&#34;]
  * azurerm_key_vault_secret.flexible_secret[&#34;PASS&#34;]
  * azurerm_key_vault_secret.flexible_secret[&#34;PORT&#34;]
  * azurerm_key_vault_secret.flexible_secret[&#34;USER&#34;]
  * azurerm_key_vault_secret.flexible_secret_staging[&#34;host&#34;]
  * azurerm_key_vault_secret.flexible_secret_staging[&#34;name&#34;]
  * azurerm_key_vault_secret.flexible_secret_staging[&#34;password&#34;]
  * azurerm_key_vault_secret.flexible_secret_staging[&#34;port&#34;]
  * azurerm_key_vault_secret.flexible_secret_staging[&#34;user&#34;]
* Delete
  * azurerm_key_vault_secret.POSTGRES-PASS
  * azurerm_key_vault_secret.POSTGRES-USER
  * azurerm_key_vault_secret.POSTGRES_DATABASE
  * azurerm_key_vault_secret.POSTGRES_HOST
  * azurerm_key_vault_secret.POSTGRES_PORT
  * azurerm_key_vault_secret.staging_db_host
  * azurerm_key_vault_secret.staging_db_name
  * azurerm_key_vault_secret.staging_db_password
  * azurerm_key_vault_secret.staging_db_port
  * azurerm_key_vault_secret.staging_db_user
  * module.reform-blob-router-db.azurerm_postgresql_active_directory_administrator.admin
  * module.reform-blob-router-db.azurerm_resource_group.data-resourcegroup
  * module.reform-blob-router-db.azurerm_template_deployment.postgres-paas
  * module.reform-blob-router-db.null_resource.set-user-permissions[0]
  * module.reform-blob-router-db.null_resource.subnet_mappings[0]
  * module.reform-blob-router-db.null_resource.subnet_mappings[1]
  * module.reform-blob-router-db.null_resource.subnet_mappings[2]
  * module.reform-blob-router-db.null_resource.subnet_mappings[3]
  * module.reform-blob-router-db.null_resource.subnet_mappings[4]
  * module.reform-blob-router-db.null_resource.subnet_mappings[5]
  * module.reform-blob-router-db.null_resource.subnet_mappings[6]
  * module.reform-blob-router-db.null_resource.subnet_mappings[7]
  * module.reform-blob-router-db.null_resource.subnet_mappings[8]
  * module.reform-blob-router-db.null_resource.subnet_mappings[9]
  * module.reform-blob-router-db.null_resource.subnet_mappings[10]
  * module.reform-blob-router-db.null_resource.subnet_mappings[11]
  * module.reform-blob-router-db.null_resource.subnet_mappings[12]
  * module.reform-blob-router-db.null_resource.subnet_mappings[13]
  * module.reform-blob-router-db.random_string.password
  * module.reform-blob-router-staging-db.azurerm_postgresql_active_directory_administrator.admin
  * module.reform-blob-router-staging-db.azurerm_resource_group.data-resourcegroup
  * module.reform-blob-router-staging-db.azurerm_template_deployment.postgres-paas
  * module.reform-blob-router-staging-db.null_resource.subnet_mappings[0]
  * module.reform-blob-router-staging-db.null_resource.subnet_mappings[1]
  * module.reform-blob-router-staging-db.null_resource.subnet_mappings[2]
  * module.reform-blob-router-staging-db.null_resource.subnet_mappings[3]
  * module.reform-blob-router-staging-db.null_resource.subnet_mappings[4]
  * module.reform-blob-router-staging-db.null_resource.subnet_mappings[5]
  * module.reform-blob-router-staging-db.null_resource.subnet_mappings[6]
  * module.reform-blob-router-staging-db.null_resource.subnet_mappings[7]
  * module.reform-blob-router-staging-db.null_resource.subnet_mappings[8]
  * module.reform-blob-router-staging-db.null_resource.subnet_mappings[9]
  * module.reform-blob-router-staging-db.null_resource.subnet_mappings[10]
  * module.reform-blob-router-staging-db.null_resource.subnet_mappings[11]
  * module.reform-blob-router-staging-db.null_resource.subnet_mappings[12]
  * module.reform-blob-router-staging-db.null_resource.subnet_mappings[13]
  * module.reform-blob-router-staging-db.random_string.password


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.POSTGRES-PASS will be destroyed
  # (because azurerm_key_vault_secret.POSTGRES-PASS is not in configuration)
  - resource "azurerm_key_vault_secret" "POSTGRES-PASS" {
      - id                      = "https://reform-scan-aat.vault.azure.net/secrets/blob-router-POSTGRES-PASS/fec256a95f7349b5b765fa0df8a305d8" -> null
      - key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/reform-scan-aat/providers/Microsoft.KeyVault/vaults/reform-scan-aat" -> null
      - name                    = "blob-router-POSTGRES-PASS" -> null
      - resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/reform-scan-aat/providers/Microsoft.KeyVault/vaults/reform-scan-aat/secrets/blob-router-POSTGRES-PASS/versions/fec256a95f7349b5b765fa0df8a305d8" -> null
      - resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/reform-scan-aat/providers/Microsoft.KeyVault/vaults/reform-scan-aat/secrets/blob-router-POSTGRES-PASS" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value) -> null
      - version                 = "fec256a95f7349b5b765fa0df8a305d8" -> null
      - versionless_id          = "https://reform-scan-aat.vault.azure.net/secrets/blob-router-POSTGRES-PASS" -> null
    }

  # azurerm_key_vault_secret.POSTGRES-USER will be destroyed
  # (because azurerm_key_vault_secret.POSTGRES-USER is not in configuration)
  - resource "azurerm_key_vault_secret" "POSTGRES-USER" {
      - id                      = "https://reform-scan-aat.vault.azure.net/secrets/blob-router-POSTGRES-USER/41600129dbae45fcb1d189bb0153abfc" -> null
      - key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/reform-scan-aat/providers/Microsoft.KeyVault/vaults/reform-scan-aat" -> null
      - name                    = "blob-router-POSTGRES-USER" -> null
      - resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/reform-scan-aat/providers/Microsoft.KeyVault/vaults/reform-scan-aat/secrets/blob-router-POSTGRES-USER/versions/41600129dbae45fcb1d189bb0153abfc" -> null
      - resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/reform-scan-aat/providers/Microsoft.KeyVault/vaults/reform-scan-aat/secrets/blob-router-POSTGRES-USER" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value) -> null
      - version                 = "41600129dbae45fcb1d189bb0153abfc" -> null
      - versionless_id          = "https://reform-scan-aat.vault.azure.net/secrets/blob-router-POSTGRES-USER" -> null
    }

  # azurerm_key_vault_secret.POSTGRES_DATABASE will be destroyed
  # (because azurerm_key_vault_secret.POSTGRES_DATABASE is not in configuration)
  - resource "azurerm_key_vault_secret" "POSTGRES_DATABASE" {
      - id                      = "https://reform-scan-aat.vault.azure.net/secrets/blob-router-POSTGRES-DATABASE/65d4b6c6d22c4981b707f9c230f291f1" -> null
      - key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/reform-scan-aat/providers/Microsoft.KeyVault/vaults/reform-scan-aat" -> null
      - name                    = "blob-router-POSTGRES-DATABASE" -> null
      - resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/reform-scan-aat/providers/Microsoft.KeyVault/vaults/reform-scan-aat/secrets/blob-router-POSTGRES-DATABASE/versions/65d4b6c6d22c4981b707f9c230f291f1" -> null
      - resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/reform-scan-aat/providers/Microsoft.KeyVault/vaults/reform-scan-aat/secrets/blob-router-POSTGRES-DATABASE" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value) -> null
      - version                 = "65d4b6c6d22c4981b707f9c230f291f1" -> null
      - versionless_id          = "https://reform-scan-aat.vault.azure.net/secrets/blob-router-POSTGRES-DATABASE" -> null
    }

  # azurerm_key_vault_secret.POSTGRES_HOST will be destroyed
  # (because azurerm_key_vault_secret.POSTGRES_HOST is not in configuration)
  - resource "azurerm_key_vault_secret" "POSTGRES_HOST" {
      - id                      = "https://reform-scan-aat.vault.azure.net/secrets/blob-router-POSTGRES-HOST/e41e892d5ac44865bae6b9ef9035dd70" -> null
      - key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/reform-scan-aat/providers/Microsoft.KeyVault/vaults/reform-scan-aat" -> null
      - name                    = "blob-router-POSTGRES-HOST" -> null
      - resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/reform-scan-aat/providers/Microsoft.KeyVault/vaults/reform-scan-aat/secrets/blob-router-POSTGRES-HOST/versions/e41e892d5ac44865bae6b9ef9035dd70" -> null
      - resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/reform-scan-aat/providers/Microsoft.KeyVault/vaults/reform-scan-aat/secrets/blob-router-POSTGRES-HOST" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value) -> null
      - version                 = "e41e892d5ac44865bae6b9ef9035dd70" -> null
      - versionless_id          = "https://reform-scan-aat.vault.azure.net/secrets/blob-router-POSTGRES-HOST" -> null
    }

  # azurerm_key_vault_secret.POSTGRES_PORT will be destroyed
  # (because azurerm_key_vault_secret.POSTGRES_PORT is not in configuration)
  - resource "azurerm_key_vault_secret" "POSTGRES_PORT" {
      - id                      = "https://reform-scan-aat.vault.azure.net/secrets/blob-router-POSTGRES-PORT/c6f7ac21f44946ef97046513d28e9da9" -> null
      - key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/reform-scan-aat/providers/Microsoft.KeyVault/vaults/reform-scan-aat" -> null
      - name                    = "blob-router-POSTGRES-PORT" -> null
      - resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/reform-scan-aat/providers/Microsoft.KeyVault/vaults/reform-scan-aat/secrets/blob-router-POSTGRES-PORT/versions/c6f7ac21f44946ef97046513d28e9da9" -> null
      - resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/reform-scan-aat/providers/Microsoft.KeyVault/vaults/reform-scan-aat/secrets/blob-router-POSTGRES-PORT" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value) -> null
      - version                 = "c6f7ac21f44946ef97046513d28e9da9" -> null
      - versionless_id          = "https://reform-scan-aat.vault.azure.net/secrets/blob-router-POSTGRES-PORT" -> null
    }

  # azurerm_key_vault_secret.flexible_secret["DATABASE"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret" {
      ~ expiration_date         = "2026-04-03T11:30:15Z" -> (known after apply)
        id                      = "https://reform-scan-aat.vault.azure.net/secrets/blob-router-POSTGRES-FLEXIBLE-DATABASE/1e877432a45644dc957e4315c2fabc59"
        name                    = "blob-router-POSTGRES-FLEXIBLE-DATABASE"
        tags                    = {
            "application"         = "bulk-scan-print"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/blob-router-service.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#rbs"
            "environment"         = "staging"
            "managedBy"           = "Bulk Scanning and Printing"
            "source"              = "blob-router PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret["HOST"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret" {
      ~ expiration_date         = "2026-04-03T11:30:15Z" -> (known after apply)
        id                      = "https://reform-scan-aat.vault.azure.net/secrets/blob-router-POSTGRES-FLEXIBLE-HOST/6aa828f356264ec7b7edac57e53f7819"
        name                    = "blob-router-POSTGRES-FLEXIBLE-HOST"
        tags                    = {
            "application"         = "bulk-scan-print"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/blob-router-service.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#rbs"
            "environment"         = "staging"
            "managedBy"           = "Bulk Scanning and Printing"
            "source"              = "blob-router PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret["PASS"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret" {
      ~ expiration_date         = "2026-04-03T11:30:15Z" -> (known after apply)
        id                      = "https://reform-scan-aat.vault.azure.net/secrets/blob-router-POSTGRES-FLEXIBLE-PASS/7f3ae7fe77f54babb83858b88c3f123c"
        name                    = "blob-router-POSTGRES-FLEXIBLE-PASS"
        tags                    = {
            "application"         = "bulk-scan-print"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/blob-router-service.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#rbs"
            "environment"         = "staging"
            "managedBy"           = "Bulk Scanning and Printing"
            "source"              = "blob-router PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret["PORT"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret" {
      ~ expiration_date         = "2026-04-03T11:30:15Z" -> (known after apply)
        id                      = "https://reform-scan-aat.vault.azure.net/secrets/blob-router-POSTGRES-FLEXIBLE-PORT/258b796368ff4a5bae718e543eae24fa"
        name                    = "blob-router-POSTGRES-FLEXIBLE-PORT"
        tags                    = {
            "application"         = "bulk-scan-print"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/blob-router-service.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#rbs"
            "environment"         = "staging"
            "managedBy"           = "Bulk Scanning and Printing"
            "source"              = "blob-router PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret["USER"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret" {
      ~ expiration_date         = "2026-04-03T11:30:15Z" -> (known after apply)
        id                      = "https://reform-scan-aat.vault.azure.net/secrets/blob-router-POSTGRES-FLEXIBLE-USER/9a55d421809b4beca1bdcd742c21f873"
        name                    = "blob-router-POSTGRES-FLEXIBLE-USER"
        tags                    = {
            "application"         = "bulk-scan-print"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/blob-router-service.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#rbs"
            "environment"         = "staging"
            "managedBy"           = "Bulk Scanning and Printing"
            "source"              = "blob-router PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret_staging["host"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret_staging" {
      ~ expiration_date         = "2026-04-03T11:30:15Z" -> (known after apply)
        id                      = "https://reform-scan-aat.vault.azure.net/secrets/blob-router-staging-flexible-db-host/51af603b98ee42aca7cf2631adc3bbe0"
        name                    = "blob-router-staging-flexible-db-host"
        tags                    = {
            "application"         = "bulk-scan-print"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/blob-router-service.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#rbs"
            "environment"         = "staging"
            "managedBy"           = "Bulk Scanning and Printing"
            "source"              = "blob-router PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret_staging["name"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret_staging" {
      ~ expiration_date         = "2026-04-03T11:30:15Z" -> (known after apply)
        id                      = "https://reform-scan-aat.vault.azure.net/secrets/blob-router-staging-flexible-db-name/1b3b5c5e0c554eb89a60aef83a27c8cb"
        name                    = "blob-router-staging-flexible-db-name"
        tags                    = {
            "application"         = "bulk-scan-print"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/blob-router-service.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#rbs"
            "environment"         = "staging"
            "managedBy"           = "Bulk Scanning and Printing"
            "source"              = "blob-router PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret_staging["password"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret_staging" {
      ~ expiration_date         = "2026-04-03T11:30:15Z" -> (known after apply)
        id                      = "https://reform-scan-aat.vault.azure.net/secrets/blob-router-staging-flexible-db-password/f4dab7117dd94d0c917122dc8264f07f"
        name                    = "blob-router-staging-flexible-db-password"
        tags                    = {
            "application"         = "bulk-scan-print"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/blob-router-service.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#rbs"
            "environment"         = "staging"
            "managedBy"           = "Bulk Scanning and Printing"
            "source"              = "blob-router PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret_staging["port"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret_staging" {
      ~ expiration_date         = "2026-04-03T11:30:15Z" -> (known after apply)
        id                      = "https://reform-scan-aat.vault.azure.net/secrets/blob-router-staging-flexible-db-port/3f6911f2652641e28c00c0f7617e8352"
        name                    = "blob-router-staging-flexible-db-port"
        tags                    = {
            "application"         = "bulk-scan-print"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/blob-router-service.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#rbs"
            "environment"         = "staging"
            "managedBy"           = "Bulk Scanning and Printing"
            "source"              = "blob-router PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret_staging["user"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret_staging" {
      ~ expiration_date         = "2026-04-03T11:30:15Z" -> (known after apply)
        id                      = "https://reform-scan-aat.vault.azure.net/secrets/blob-router-staging-flexible-db-user/dceb88eefa2e4175b5479e9433a0a42c"
        name                    = "blob-router-staging-flexible-db-user"
        tags                    = {
            "application"         = "bulk-scan-print"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/blob-router-service.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#rbs"
            "environment"         = "staging"
            "managedBy"           = "Bulk Scanning and Printing"
            "source"              = "blob-router PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret_standard_format["DATABASE"] will be created
  + resource "azurerm_key_vault_secret" "flexible_secret_standard_format" {
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/reform-scan-aat/providers/Microsoft.KeyVault/vaults/reform-scan-aat"
      + name                    = "blob-router-POSTGRES-DATABASE"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "application"         = "bulk-scan-print"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/blob-router-service.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#rbs"
          + "environment"         = "staging"
          + "managedBy"           = "Bulk Scanning and Printing"
          + "source"              = "blob-router PostgreSQL"
        }
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.flexible_secret_standard_format["HOST"] will be created
  + resource "azurerm_key_vault_secret" "flexible_secret_standard_format" {
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/reform-scan-aat/providers/Microsoft.KeyVault/vaults/reform-scan-aat"
      + name                    = "blob-router-POSTGRES-HOST"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "application"         = "bulk-scan-print"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/blob-router-service.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#rbs"
          + "environment"         = "staging"
          + "managedBy"           = "Bulk Scanning and Printing"
          + "source"              = "blob-router PostgreSQL"
        }
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.flexible_secret_standard_format["PASS"] will be created
  + resource "azurerm_key_vault_secret" "flexible_secret_standard_format" {
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/reform-scan-aat/providers/Microsoft.KeyVault/vaults/reform-scan-aat"
      + name                    = "blob-router-POSTGRES-PASS"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "application"         = 

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

XJzL01pY3Jvc29mdC5OZXR3b3JrL3ZpcnR1YWxOZXR3b3Jrcy9jb3JlLWluZnJhLXZuZXQtYWF0L3N1Ym5ldHMvYWtzIn0seyJydWxlX25hbWUiOiJqZW5raW5zLWFrcyIsInN1Ym5ldF9pZCI6Ii9zdWJzY3JpcHRpb25zLzFiYWY1NDcwLTFjM2UtNDBkMy1hNmY3LTc0YmZiY2U0YjM0OC9yZXNvdXJjZUdyb3Vwcy9jZnQtcHRsLW5ldHdvcmstcmcvcHJvdmlkZXJzL01pY3Jvc29mdC5OZXR3b3JrL3ZpcnR1YWxOZXR3b3Jrcy9jZnQtcHRsLXZuZXQvc3VibmV0cy9pYWFzIn0seyJydWxlX25hbWUiOiJqZW5raW5zLWFrcy1hZ2VudCIsInN1Ym5ldF9pZCI6Ii9zdWJzY3JpcHRpb25zLzFiYWY1NDcwLTFjM2UtNDBkMy1hNmY3LTc0YmZiY2U0YjM0OC9yZXNvdXJjZUdyb3Vwcy9jZnQtcHRsLW5ldHdvcmstcmcvcHJvdmlkZXJzL01pY3Jvc29mdC5OZXR3b3JrL3ZpcnR1YWxOZXR3b3Jrcy9jZnQtcHRsLXZuZXQvc3VibmV0cy9ha3MtMDAifSx7InJ1bGVfbmFtZSI6InNoYXJlZC1zZXJ2aWNlcy10ZXN0LWFrczAwIiwic3VibmV0X2lkIjoiL3N1YnNjcmlwdGlvbnMvM2VlYzViZGUtN2ZlYi00NTY2LWJmYjYtODA1ZGY2ZTEwYjkwL3Jlc291cmNlR3JvdXBzL3NzLXRlc3QtbmV0d29yay1yZy9wcm92aWRlcnMvTWljcm9zb2Z0Lk5ldHdvcmsvdmlydHVhbE5ldHdvcmtzL3NzLXRlc3Qtdm5ldC9zdWJuZXRzL2Frcy0wMCJ9LHsicnVsZV9uYW1lIjoic2hhcmVkLXNlcnZpY2VzLXRlc3QtYWtzMDEiLCJzdWJuZXRfaWQiOiIvc3Vic2NyaXB0aW9ucy8zZWVjNWJkZS03ZmViLTQ1NjYtYmZiNi04MDVkZjZlMTBiOTAvcmVzb3VyY2VHcm91cHMvc3MtdGVzdC1uZXR3b3JrLXJnL3Byb3ZpZGVycy9NaWNyb3NvZnQuTmV0d29yay92aXJ0dWFsTmV0d29ya3Mvc3MtdGVzdC12bmV0L3N1Ym5ldHMvYWtzLTAxIn0seyJydWxlX25hbWUiOiJzaGFyZWQtc2VydmljZXMtc3RnLWFrczAwIiwic3VibmV0X2lkIjoiL3N1YnNjcmlwdGlvbnMvNzRkYWNkNGYtYTI0OC00NWJiLWEyZjAtYWY3MDBkYzRjZjY4L3Jlc291cmNlR3JvdXBzL3NzLXN0Zy1uZXR3b3JrLXJnL3Byb3ZpZGVycy9NaWNyb3NvZnQuTmV0d29yay92aXJ0dWFsTmV0d29ya3Mvc3Mtc3RnLXZuZXQvc3VibmV0cy9ha3MtMDAifSx7InJ1bGVfbmFtZSI6InNoYXJlZC1zZXJ2aWNlcy1zdGctYWtzMDEiLCJzdWJuZXRfaWQiOiIvc3Vic2NyaXB0aW9ucy83NGRhY2Q0Zi1hMjQ4LTQ1YmItYTJmMC1hZjcwMGRjNGNmNjgvcmVzb3VyY2VHcm91cHMvc3Mtc3RnLW5ldHdvcmstcmcvcHJvdmlkZXJzL01pY3Jvc29mdC5OZXR3b3JrL3ZpcnR1YWxOZXR3b3Jrcy9zcy1zdGctdm5ldC9zdWJuZXRzL2Frcy0wMSJ9LHsicnVsZV9uYW1lIjoiYmFzdGlvbi1ub25wcm9kLXZuZXQiLCJzdWJuZXRfaWQiOiIvc3Vic2NyaXB0aW9ucy9iNDRlYjQ3OS05YWUyLTQyZTctOWM2My1mM2M1OTk3MTliNmYvcmVzb3VyY2VHcm91cHMvYmFzdGlvbi1ub25wcm9kLXJnL3Byb3ZpZGVycy9NaWNyb3NvZnQuTmV0d29yay92aXJ0dWFsTmV0d29ya3MvYmFzdGlvbi1ub25wcm9kLXZuZXQvc3VibmV0cy9iYXN0aW9uIn0seyJydWxlX25hbWUiOiJpZGFtLWFhdDItdm5ldCIsInN1Ym5ldF9pZCI6Ii9zdWJzY3JpcHRpb25zLzFjNGYwNzA0LWEyOWUtNDAzZC1iNzE5LWI5MGMzNGVmMTRjOS9yZXNvdXJjZUdyb3Vwcy9jb3JlLWluZnJhLWlkYW0tYWF0Mi9wcm92aWRlcnMvTWljcm9zb2Z0Lk5ldHdvcmsvdmlydHVhbE5ldHdvcmtzL2NvcmUtaW5mcmEtdm5ldC1pZGFtLWFhdDIvc3VibmV0cy9jb3JlLWluZnJhLXN1Ym5ldC03LWlkYW0tYWF0MiJ9LHsicnVsZV9uYW1lIjoic2hhcmVkLXNlcnZpY2VzLWRldi1ha3MwMCIsInN1Ym5ldF9pZCI6Ii9zdWJzY3JpcHRpb25zLzg2N2E4NzhiLWNiNjgtNGRlNS05NzQxLTM2MWFjOWUxNzhiNi9yZXNvdXJjZUdyb3Vwcy9zcy1kZXYtbmV0d29yay1yZy9wcm92aWRlcnMvTWljcm9zb2Z0Lk5ldHdvcmsvdmlydHVhbE5ldHdvcmtzL3NzLWRldi12bmV0L3N1Ym5ldHMvYWtzLTAwIn0seyJydWxlX25hbWUiOiJzaGFyZWQtc2VydmljZXMtZGV2LWFrczAxIiwic3VibmV0X2lkIjoiL3N1YnNjcmlwdGlvbnMvODY3YTg3OGItY2I2OC00ZGU1LTk3NDEtMzYxYWM5ZTE3OGI2L3Jlc291cmNlR3JvdXBzL3NzLWRldi1uZXR3b3JrLXJnL3Byb3ZpZGVycy9NaWNyb3NvZnQuTmV0d29yay92aXJ0dWFsTmV0d29ya3Mvc3MtZGV2LXZuZXQvc3VibmV0cy9ha3MtMDEifV0="
          - "env"                        = "aat"
          - "geoRedundantBackup"         = "Enabled"
          - "location"                   = "UK South"
          - "serverName"                 = "blob-router-staging-aat"
          - "skuCapacity"                = "2"
          - "skuName"                    = "GP_Gen5_2"
          - "skuSizeMB"                  = "51200"
          - "skuTier"                    = "GeneralPurpose"
          - "sslEnforcement"             = "Enabled"
          - "version"                    = "11"
        } -> null
      - resource_group_name = "blob-router-staging-data-aat" -> null
      - template_body       = jsonencode(
            {
              - "$schema"      = "http://schema.management.azure.com/schemas/2014-04-01-preview/deploymentTemplate.json#"
              - contentVersion = "1.0.0.0"
              - parameters     = {
                  - administratorLogin         = {
                      - maxLength = 16
                      - minLength = 1
                      - type      = "string"
                    }
                  - administratorLoginPassword = {
                      - type = "securestring"
                    }
                  - backupRetentionDays        = {
                      - defaultValue = 7
                      - type         = "string"
                    }
                  - charset                    = {
                      - type = "string"
                    }
                  - collation                  = {
                      - type = "string"
                    }
                  - commonTags                 = {
                      - type = "string"
                    }
                  - dbName                     = {
                      - type = "string"
                    }
                  - dbRules                    = {
                      - type = "string"
                    }
                  - env                        = {
                      - metadata = {
                          - description = "The tag"
                        }
                      - type     = "string"
                    }
                  - geoRedundantBackup         = {
                      - defaultValue = "Enabled"
                      - type         = "string"
                    }
                  - location                   = {
                      - allowedValues = [
                          - "UK West",
                          - "ukwest",
                          - "UK South",
                          - "uksouth",
                        ]
                      - defaultValue  = "UK South"
                      - type          = "string"
                    }
                  - serverName                 = {
                      - maxLength = 63
                      - minLength = 2
                      - type      = "string"
                    }
                  - skuCapacity                = {
                      - defaultValue = 2
                      - type         = "string"
                    }
                  - skuFamily                  = {
                      - allowedValues = [
                          - "Gen5",
                        ]
                      - defaultValue  = "Gen5"
                      - type          = "string"
                    }
                  - skuName                    = {
                      - allowedValues = [
                          - "B_Gen5_1",
                          - "B_Gen5_2",
                          - "GP_Gen5_2",
                          - "GP_Gen5_4",
                          - "GP_Gen5_8",
                          - "GP_Gen5_16",
                          - "GP_Gen5_32",
                          - "MO_Gen5_2",
                          - "MO_Gen5_4",
                          - "MO_Gen5_8",
                          - "MO_Gen5_16",
                          - "MO_Gen5_32",
                        ]
                      - defaultValue  = "GP_Gen5_2"
                      - type          = "string"
                    }
                  - skuSizeMB                  = {
                      - defaultValue = "51200"
                      - type         = "string"
                    }
                  - skuTier                    = {
                      - allowedValues = [
                          - "Basic",
                          - "GeneralPurpose",
                          - "MemoryOptimized",
                        ]
                      - defaultValue  = "GeneralPurpose"
                      - type          = "string"
                    }
                  - sslEnforcement             = {
                      - defaultValue = "Enabled"
                      - type         = "string"
                    }
                  - version                    = {
                      - allowedValues = [
                          - "9.5",
                          - "9.6",
                          - "10",
                          - "11",
                        ]
                      - defaultValue  = "9.6"
                      - type          = "string"
                    }
                }
              - resources      = [
                  - {
                      - apiVersion = "2017-12-01-preview"
                      - kind       = ""
                      - location   = "[parameters('location')]"
                      - name       = "[parameters('serverName')]"
                      - properties = {
                          - administratorLogin         = "[parameters('administratorLogin')]"
                          - administratorLoginPassword = "[parameters('administratorLoginPassword')]"
                          - sslEnforcement             = "[parameters('sslEnforcement')]"
                          - storageProfile             = {
                              - backupRetentionDays = "[int(parameters('backupRetentionDays'))]"
                              - geoRedundantBackup  = "[parameters('geoRedundantBackup')]"
                              - storageMB           = "[parameters('skuSizeMB')]"
                            }
                          - version                    = "[parameters('version')]"
                        }
                      - resources  = [
                          - {
                              - apiVersion = "2017-12-01-preview"
                              - dependsOn  = [
                                  - "[concat('Microsoft.DBforPostgreSQL/servers/', parameters('serverName'))]",
                                ]
                              - name       = "[parameters('dbName')]"
                              - properties = {
                                  - charset   = "[parameters('charset')]"
                                  - collation = "[parameters('collation')]"
                                }
                              - type       = "databases"
                            },
                        ]
                      - sku        = {
                          - capacity = "[parameters('skuCapacity')]"
                          - family   = "[parameters('skuFamily')]"
                          - name     = "[parameters('skuName')]"
                          - size     = "[parameters('skuSizeMB')]"
                          - tier     = "[parameters('skuTier')]"
                        }
                      - tags       = "[variables('tags')]"
                      - type       = "Microsoft.DBforPostgreSQL/servers"
                    },
                  - {
                      - apiVersion = "2017-12-01-preview"
                      - copy       = {
                          - count = "[length(variables('dbRules'))]"
                          - name  = "storagecopy"
                        }
                      - dependsOn  = [
                          - "[concat('Microsoft.DBforPostgreSQL/servers/', parameters('serverName'))]",
                        ]
                      - location   = "[parameters('location')]"
                      - name       = "[concat(parameters('serverName'), '/', variables('dbRules')[copyIndex()].rule_name)]"
                      - properties = {
                          - ignoreMissingVnetServiceEndpoint = true
                          - virtualNetworkSubnetId           = "[variables('dbRules')[copyIndex()].subnet_id]"
                        }
                      - type       = "Microsoft.DBforPostgreSQL/servers/virtualNetworkRules"
                    },
                ]
              - variables      = {
                  - dbRules = "[base64ToJson(parameters('dbRules'))]"
                  - tags    = "[base64ToJson(parameters('commonTags'))]"
                }
            }
        ) -> null
    }

  # module.reform-blob-router-staging-db.null_resource.subnet_mappings[0] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "269609395479729951" -> null
      - triggers = {
          - "rule_name" = "cftaks-tf-aks00"
          - "subnet_id" = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/virtualNetworks/cft-aat-vnet/subnets/aks-00"
        } -> null
    }

  # module.reform-blob-router-staging-db.null_resource.subnet_mappings[1] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "5058139561862845747" -> null
      - triggers = {
          - "rule_name" = "cftaks-tf-aks01"
          - "subnet_id" = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/virtualNetworks/cft-aat-vnet/subnets/aks-01"
        } -> null
    }

  # module.reform-blob-router-staging-db.null_resource.subnet_mappings[2] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "4971530185673261353" -> null
      - triggers = {
          - "rule_name" = "ase"
          - "subnet_id" = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/core-infra-aat/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-aat/subnets/core-infra-subnet-3-aat"
        } -> null
    }

  # module.reform-blob-router-staging-db.null_resource.subnet_mappings[3] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "4060838740601804310" -> null
      - triggers = {
          - "rule_name" = "aks"
          - "subnet_id" = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/core-infra-aat/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-aat/subnets/aks"
        } -> null
    }

  # module.reform-blob-router-staging-db.null_resource.subnet_mappings[4] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "4540564099020919875" -> null
      - triggers = {
          - "rule_name" = "jenkins-aks"
          - "subnet_id" = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-ptl-network-rg/providers/Microsoft.Network/virtualNetworks/cft-ptl-vnet/subnets/iaas"
        } -> null
    }

  # module.reform-blob-router-staging-db.null_resource.subnet_mappings[5] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "4878831248981491072" -> null
      - triggers = {
          - "rule_name" = "jenkins-aks-agent"
          - "subnet_id" = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-ptl-network-rg/providers/Microsoft.Network/virtualNetworks/cft-ptl-vnet/subnets/aks-00"
        } -> null
    }

  # module.reform-blob-router-staging-db.null_resource.subnet_mappings[6] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "6839199519161363637" -> null
      - triggers = {
          - "rule_name" = "shared-services-test-aks00"
          - "subnet_id" = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/virtualNetworks/ss-test-vnet/subnets/aks-00"
        } -> null
    }

  # module.reform-blob-router-staging-db.null_resource.subnet_mappings[7] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "5410783136978771579" -> null
      - triggers = {
          - "rule_name" = "shared-services-test-aks01"
          - "subnet_id" = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/virtualNetworks/ss-test-vnet/subnets/aks-01"
        } -> null
    }

  # module.reform-blob-router-staging-db.null_resource.subnet_mappings[8] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "8888633049461778045" -> null
      - triggers = {
          - "rule_name" = "shared-services-stg-aks00"
          - "subnet_id" = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/virtualNetworks/ss-stg-vnet/subnets/aks-00"
        } -> null
    }

  # module.reform-blob-router-staging-db.null_resource.subnet_mappings[9] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "4653126931547397026" -> null
      - triggers = {
          - "rule_name" = "shared-services-stg-aks01"
          - "subnet_id" = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/virtualNetworks/ss-stg-vnet/subnets/aks-01"
        } -> null
    }

  # module.reform-blob-router-staging-db.null_resource.subnet_mappings[10] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "887610935382658189" -> null
      - triggers = {
          - "rule_name" = "bastion-nonprod-vnet"
          - "subnet_id" = "/subscriptions/b44eb479-9ae2-42e7-9c63-f3c599719b6f/resourceGroups/bastion-nonprod-rg/providers/Microsoft.Network/virtualNetworks/bastion-nonprod-vnet/subnets/bastion"
        } -> null
    }

  # module.reform-blob-router-staging-db.null_resource.subnet_mappings[11] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "717509813698557187" -> null
      - triggers = {
          - "rule_name" = "idam-aat2-vnet"
          - "subnet_id" = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/core-infra-idam-aat2/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-idam-aat2/subnets/core-infra-subnet-7-idam-aat2"
        } -> null
    }

  # module.reform-blob-router-staging-db.null_resource.subnet_mappings[12] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "5025399331103250221" -> null
      - triggers = {
          - "rule_name" = "shared-services-dev-aks00"
          - "subnet_id" = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/ss-dev-network-rg/providers/Microsoft.Network/virtualNetworks/ss-dev-vnet/subnets/aks-00"
        } -> null
    }

  # module.reform-blob-router-staging-db.null_resource.subnet_mappings[13] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "1939698016233075672" -> null
      - triggers = {
          - "rule_name" = "shared-services-dev-aks01"
          - "subnet_id" = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/ss-dev-network-rg/providers/Microsoft.Network/virtualNetworks/ss-dev-vnet/subnets/aks-01"
        } -> null
    }

  # module.reform-blob-router-staging-db.random_string.password will be destroyed
  # (because random_string.password is not in configuration)
  - resource "random_string" "password" {
      - id          = "uJ$N3To>fUf$8Sy@" -> null
      - length      = 16 -> null
      - lower       = true -> null
      - min_lower   = 0 -> null
      - min_numeric = 0 -> null
      - min_special = 0 -> null
      - min_upper   = 0 -> null
      - number      = true -> null
      - numeric     = true -> null
      - result      = "uJ$N3To>fUf$8Sy@" -> null
      - special     = true -> null
      - upper       = true -> null
    }

Plan: 5 to add, 10 to change, 47 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":2195,"Program":"tfcmt","SHA1":"","Target":"aat","Vars":{}} -->